In [31]:
import pandas as pd
import numpy as np
import itertools

In [32]:
data = np.array(['kavi', 'shyam', 'ravi'])
s = pd.Series(data, index =[5, 3, 1])
print(s)

5     kavi
3    shyam
1     ravi
dtype: object

In [33]:
data = np.array([2, 3, 4])
s = pd.Series(data, index =['Feb', 'March', 'April'])
print(s)

Feb      2
March    3
April    4
dtype: int64

In [34]:
di = {"India" : "New Delhi" , "UK" : "London", "Japan" : "Tokyo"}

In [35]:
se = pd.Series(di)

In [36]:
print(se)

India    New Delhi
UK          London
Japan        Tokyo
dtype: object

In [37]:
#Indexing
print(se["India"])

New Delhi

In [38]:
# #Slicing
# dict(itertools.islice(se.items(), 2))

In [39]:
se.head(2)

India    New Delhi
UK          London
dtype: object

In [40]:
se.tail(2)

UK       London
Japan     Tokyo
dtype: object

In [41]:
D = [[90,91,97], [92,81,96], [89,91,88], [81,71,67] , [94,95,99]]
df2 = pd.DataFrame(D, columns = ['Maths', 'Science', 'Hindi'] , index = ['Arnab', 'Ramit','Samridhi','Riya','Mallika'])
df2

          Maths  Science  Hindi
Arnab        90       91     97
Ramit        92       81     96
Samridhi     89       91     88
Riya         81       71     67
Mallika      94       95     99

In [45]:
df2["Ramit" : "Riya"] = 30
df2

          Maths  Science  Hindi
Arnab        90       91     97
Ramit        30       30     30
Samridhi     30       30     30
Riya         30       30     30
Mallika      94       95     99

In [13]:
# D = [[90,92,89,81,94], [91,81,91,71,95], [97,96,88,67,99]]
# df = pd.DataFrame(D, columns = ['Arnab', 'Ramit','Samridhi','Riya','Mallika'] , index = ['Maths', 'Science', 'Hindi'])
# df

In [14]:
df2.describe()

           Maths    Science      Hindi
count   5.000000   5.000000   5.000000
mean   89.200000  85.800000  89.400000
std     4.969909   9.757049  13.202273
min    81.000000  71.000000  67.000000
25%    89.000000  81.000000  88.000000
50%    90.000000  91.000000  96.000000
75%    92.000000  91.000000  97.000000
max    94.000000  95.000000  99.000000

In [15]:
df2.sort_values('Maths',ascending=False)

          Maths  Science  Hindi
Mallika      94       95     99
Ramit        92       81     96
Arnab        90       91     97
Samridhi     89       91     88
Riya         81       71     67

In [16]:
df2.mean()

Maths      89.2
Science    85.8
Hindi      89.4
dtype: float64

In [17]:
df2[df2['Maths']>90]

         Maths  Science  Hindi
Ramit       92       81     96
Mallika     94       95     99

In [25]:
d = {'one' : pd.Series([10, 20, 30, 40],
                       index =['a', 'b', 'c', 'd']),
      'two' : pd.Series([10, 20, 40],
                       index =['a', 'b', 'd'])}
df = pd.DataFrame(d)

In [22]:
df

   one   two
a   10  10.0
b   20  20.0
c   30   NaN
d   40  40.0